# CutForegroundPatternColor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..CutForegroundPatternColor Property
OverrideGraphicSettings Class See Also
---
The override color of the foreground pattern of cut faces.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public Color CutForegroundPatternColor { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CutForegroundPatternColor As Color
	Get
```

Visual C++
---
```text
public:
property Color^ CutForegroundPatternColor {
	Color^ get ();
}
```

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace